tutorials/legacy/combustion/PDRFoam/flamePropagationWithObstacles/0/B.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   nonuniform List<symmTensor>
8025
(
(1.785697 0 0 1.785697 0 1.875)
(1.577364 0 0 1.577364 0 1.666667)
(1.622015 0 0 1.622015 0 1.666667)
(1.853867 0 0 0.713867 0 0.875)
(0.928867 0 0 0.607067 0 0.833334)
(1.577364 0 0 1.577364 0 1.666667)
(1.666667 0 0 1.666667 0 1.666667)
(1.622015 0 0 1.622015 0 1.666667)
...
)
;

boundaryField
{
    outer
    {
        type            uniformInletOutlet;
        uniformInletValue (0 0 0 0 0 0);
        value           uniform (0 0 0 0 0 0);
    }

    ground
    {
        type            zeroGradient;
    }

    blockedFaces
    {
        type            zeroGradient;
        value           uniform (0 0 0 0 0 0);
    }

    baffleWall
    {
        type            zeroGradient;
        value           uniform (0 0 0 0 0 0);
    }

    baffleCyclic_half0
    {
        type            cyclic;
    }

    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
